# HingeElement1D

Representation of hinge element 1D

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.hinge_element1_d import HingeElement1D

# TODO update the JSON string below
json = "{}"
# create an instance of HingeElement1D from a JSON string
hinge_element1_d_instance = HingeElement1D.from_json(json)
# print the JSON string representation of the object
print(HingeElement1D.to_json())

# convert the object into a dict
hinge_element1_d_dict = hinge_element1_d_instance.to_dict()
# create an instance of HingeElement1D from a dict
hinge_element1_d_from_dict = HingeElement1D.from_dict(hinge_element1_d_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)